Now the error makes more sense:
```
$ terraform apply
juju_model.development: Refreshing state... [id=51f29c40-4f7e-4c03-8d1a-d10f2b433f01]
juju_machine.this_machine_1: Refreshing state... [id=development:0/lxd/1:this_machine_1]
juju_machine.this_machine: Refreshing state... [id=development:0/lxd/0:this_machine]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # juju_machine.this_machine_2 will be created
  + resource "juju_machine" "this_machine_2" {
      + base       = (known after apply)
      + id         = (known after apply)
      + machine_id = (known after apply)
      + model      = "development"
      + name       = "this_machine_1"
      + placement  = ":fail"
      + series     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

juju_machine.this_machine_2: Creating...
╷
│ Error: Client Error
│ 
│   with juju_machine.this_machine_2,
│   on main.tf line 28, in resource "juju_machine" "this_machine_2":
│   28: resource "juju_machine" "this_machine_2" {
│ 
│ Unable to create machine, got error: cannot add a new machine: availability zone ":fail" not valid
```